import { houdayKasan, jihatsuKasan } from "./BlCalcData2021"

export { houdayKasan } from "./calcDatas2024/houdayKasan2024"
export { houdayService as houdySirvice } from "./calcDatas2024/houdayService2024"
export { jihatsuKasan } from "./calcDatas2024/jihatsuKasan2024"
export { jihatsuService } from "./calcDatas2024/jihatsuService2024"
export { hohouKasan } from "./calcDatas2024/hohouKasan2024"
export { hohouService } from "./calcDatas2024/hohouService2024"

export const unitPrice = {
  放課後等デイサービス:{
    一級地: 11.20, 二級地: 10.96, 三級地: 10.90, 四級地: 10.72,
    五級地: 10.60, 六級地: 10.36, 七級地: 10.18, その他: 10.00,
  },
  児童発達支援:{
    一級地: 11.20, 二級地: 10.96, 三級地: 10.90, 四級地: 10.72,
    五級地: 10.60, 六級地: 10.36, 七級地: 10.18, その他: 10.00,
  },
  保育所等訪問支援:{
    一級地: 11.24, 二級地: 10.99, 三級地: 10.93, 四級地: 10.74,
    五級地: 10.62, 六級地: 10.37, 七級地: 10.19, その他: 10.00,
  },
  放課後等デイサービス重心:{
    一級地: 11.52, 二級地: 11.22, 三級地: 11.14, 四級地: 10.91,
    五級地: 10.76, 六級地: 10.46, 七級地: 10.23, その他: 10.00,
  },
  児童発達支援重心:{
    一級地: 11.52, 二級地: 11.22, 三級地: 11.14, 四級地: 10.91,
    五級地: 10.76, 六級地: 10.46, 七級地: 10.23, その他: 10.00,
  },
  児童発達支援センター:{
    一級地: 11.24, 二級地: 10.99, 三級地: 10.93, 四級地: 10.74,
    五級地: 10.62, 六級地: 10.37, 七級地: 10.19, その他: 10.00,
  },
  障害児相談支援:{
    一級地: 11.20, 二級地: 10.96, 三級地: 10.90, 四級地: 10.72,
    五級地: 10.60, 六級地: 10.36, 七級地: 10.18, その他: 10.00,
  },
  計画相談支援:{
    一級地: 11.20, 二級地: 10.96, 三級地: 10.90, 四級地: 10.72,
    五級地: 10.60, 六級地: 10.36, 七級地: 10.18, その他: 10.00,
  },
}

export const chiikiKubun = {
  一級地: 11, 二級地: 12, 三級地: 13, 四級地: 14,
  五級地: 15, 六級地: 16, 七級地: 17, その他: 23,
}
// 計画相談支援は地域区分コードが違う
export const chiikiKubunAdult = {
  一級地: '01', 二級地: '02', 三級地: '03', 四級地: '04',
  五級地: '05', 六級地: '06', 七級地: '07', その他: '20',
}

export const serviceSyubetu = {
  放課後等デイサービス: 63, 児童発達支援: 61,
  '63': '放課後等デイサービス', '61': '児童発達支援',
  '64': '保育所等訪問支援', '保育所等訪問支援': 64,
  '52': '計画相談支援', '計画相談支援': 52,
  '55': '障害児相談支援', '障害児相談支援': 55,
}

// 決定サービスコード
export const ketteiScodeOld = {
  放課後等デイサービス: 631000, 児童発達支援: 611000,
}

// 決定サービスコード新
export const ketteiScode = [
  {service:'児童発達支援',iCare:0,type:'障害児',kettei:'611000',},
  {service:'児童発達支援',iCare:0,type:'難聴児',kettei:'612000',},
  {service:'児童発達支援',iCare:0,type:'重症心身障害児',kettei:'613000',},
  {service:'児童発達支援',iCare:3,type:'障害児',kettei:'614000',},
  {service:'児童発達支援',iCare:16,type:'障害児',kettei:'615000',},
  {service:'児童発達支援',iCare:32,type:'障害児',kettei:'616000',},
  {service:'児童発達支援',iCare:3,type:'難聴児',kettei:'617000',},
  {service:'児童発達支援',iCare:16,type:'難聴児',kettei:'618000',},
  {service:'児童発達支援',iCare:32,type:'難聴児',kettei:'619000',},
  {service:'児童発達支援',iCare:3,type:'重症心身障害児',kettei:'61A000',},
  {service:'児童発達支援',iCare:16,type:'重症心身障害児',kettei:'61B000',},
  {service:'児童発達支援',iCare:32,type:'重症心身障害児',kettei:'61C000',},
  {service:'児童発達支援',kyoudo:1,kettei:'610908',},
  {service:'放課後等デイサービス',iCare:0,type:'障害児',kettei:'631000',},
  {service:'放課後等デイサービス',iCare:0,type:'重症心身障害児',kettei:'632000',},
  {service:'放課後等デイサービス',iCare:3,type:'障害児',kettei:'633000',},
  {service:'放課後等デイサービス',iCare:16,type:'障害児',kettei:'634000',},
  {service:'放課後等デイサービス',iCare:32,type:'障害児',kettei:'635000',},
  {service:'放課後等デイサービス',iCare:3,type:'重症心身障害児',kettei:'636000',},
  {service:'放課後等デイサービス',iCare:16,type:'重症心身障害児',kettei:'637000',},
  {service:'放課後等デイサービス',iCare:32,type:'重症心身障害児',kettei:'638000',},
  {service:'放課後等デイサービス',kyoudo:1,kettei:'630908',},
  {service:'保育所等訪問支援',iCare:0,type:'障害児',kettei:'641000',},
  {service:'保育所等訪問支援',iCare:0,type:'難聴児',kettei:'641000',},
  {service:'保育所等訪問支援',iCare:0,type:'重症心身障害児',kettei:'641000',},
  {service:'保育所等訪問支援',iCare:3,type:'障害児',kettei:'641000',},
  {service:'保育所等訪問支援',iCare:16,type:'障害児',kettei:'641000',},
  {service:'保育所等訪問支援',iCare:32,type:'障害児',kettei:'641000',},
  {service:'保育所等訪問支援',iCare:3,type:'難聴児',kettei:'641000',},
  {service:'保育所等訪問支援',iCare:16,type:'難聴児',kettei:'641000',},
  {service:'保育所等訪問支援',iCare:32,type:'難聴児',kettei:'641000',},
  {service:'保育所等訪問支援',iCare:3,type:'重症心身障害児',kettei:'641000',},
  {service:'保育所等訪問支援',iCare:16,type:'重症心身障害児',kettei:'641000',},
  {service:'保育所等訪問支援',iCare:32,type:'重症心身障害児',kettei:'641000',},

]
// 送迎をカウントするために送迎のサービスコードを定義
export const SOUGEY_SVC_CODE = [
  // 一定条件はカウントしないなどと言う謎設定があったが無視する
  // やっぱり一定条件はカウントしないよ！2024/05/22
  '636240','636243','636241','636244','636246','636247',
  '616240','616423','616241','616424','616242','616243',

];


// 同じく家族連携
// 保訪のサービスコードを追加
// export const KATEI_SVC_CODE = [
//   '635350', '635351', '615350', '615351', '645351', '645350',
// ];

// 家族支援サービスコード
export const KAZOKUSHIEN_SVC_CODE = [
  '635603','635604','635605','635606','635607','635608',
  '615603','615604','615605','615606','615607','615608',
  '645603','645604','645605','645606','645607','645608',
]

// 関係機関連携加算のサービスコード
export const KANKEIRENKEI_SVC_CODE = [
  '616760','616761','616767','616768',
  '636760','636761','636767','636768',
  '646760', // <-漏れていたので追加
];
// 事業所間連携加算のサービスコード
export const JIGYOUSYO_RENKEI_SVC_CODE = [
  "635710","635711","615710","615711",
];

// 欠席対応加算確認用
export const KESSEKI_SVC_CODE = [
  '635496', '635495', 
  '615495', '615496', 
];
// 欠席時対応加算２のサービスコード
// export const KESSEKI_SVC_CODE2 = ['635500', ];

// 食事提供加算
export const SYOKUJI_SVC_CODE = ['615310', '615311', ];

// 初回加算
export const SYOKAI_SVC_CODE = ['646020', ];
// daddictionの中で保訪に適用するもの
export const DADDICTION_HOHOU = [
  '初回加算', '訪問支援員特別加算24','ケアニーズ対応加算','多職種連携支援加算', '特別地域加算'
];

// export const hohouService = [
//   {s:'641111',v:1071,c:'保訪',baseItem: true,},
//   {s:'641112',v:996,c:'保訪・複数支援',baseItem: true,},
//   {s:'641113',v:750,c:'保訪・未計画１',baseItem: true,},
//   {s:'641114',v:698,c:'保訪・未計画１・複数支援',baseItem: true,},
//   {s:'641125',v:536,c:'保訪・未計画２',baseItem: true,},
//   {s:'641126',v:498,c:'保訪・未計画２・複数支援',baseItem: true,},
//   {s:'649111',v:750,c:'保訪・責欠１',baseItem: true,},
//   {s:'649112',v:698,c:'保訪・責欠１・複数支援',baseItem: true,},
//   {s:'649123',v:536,c:'保訪・責欠２',baseItem: true,},
//   {s:'649124',v:438,c:'保訪・責欠２・複数支援',baseItem: true,},
// ];

// export const hohouKasan = [
//   {"s": "64Z001", "v": -5.0, "c": "保訪身体拘束廃止未実施減算", "name": "身体拘束廃止未実施減算", "value": 1},
//   {"s": '646770', "v": 15.0, "c": "保訪特別地域加算", "name": "特別地域加算", "value": 1, "method": "baseItemRate"},
//   {"s": '646020', "v": 200.0, "c": "保訪初回加算", "name": "初回加算", "value": 1, "limit": 1},
//   {"s": '645350', "v": 187.0, "c": "保訪家庭連携加算１", "name": "家庭連携加算", "value": 0, "limit": 2},
//   {"s": '645351', "v": 280.0, "c": "保訪家庭連携加算２", "name": "家庭連携加算", "value": 60, "limit": 2},
//   {"s": '645370', "v": 150.0, "c": "保訪上限額管理加算", "name": "利用者負担上限額管理加算", "value": 1},
//   {"s": '646621', "v": 8.1, "c": "保訪処遇改善加算Ⅰ", "name": "福祉・介護職員処遇改善加算", "value": "福祉・介護職員処遇改善加算Ⅰ", "method": "syoguu"},
//   {"s": '646616', "v": 5.9, "c": "保訪処遇改善加算Ⅱ", "name": "福祉・介護職員処遇改善加算", "value": "福祉・介護職員処遇改善加算Ⅱ", "method": "syoguu"},
//   {"s": '646596', "v": 3.3, "c": "保訪処遇改善加算Ⅲ", "name": "福祉・介護職員処遇改善加算", "value": "福祉・介護職員処遇改善加算Ⅲ", "method": "syoguu"},
//   {"s": '646771', "v": 1.1, "c": "保訪特定処遇改善加算", "name": "特定処遇改善加算", "value": 1, "method": "syoguu"},
//   {"s": '646766', "v": 2.0, "c": "保訪ベースアップ等支援加算", "name": "福祉・介護職員等ベースアップ等支援加算", "value": 1, "method": "syoguu"},
//   {"s": '645621', "v": 12.9, "c": "保訪処遇改善加算Ⅰ", "name": "福祉・介護職員処遇改善加算", "value": 100, "method": "syoguu"},
//   {"s": '645623', "v": 11.8, "c": "保訪処遇改善加算Ⅲ", "name": "福祉・介護職員処遇改善加算", "value": 300, "method": "syoguu"},
//   {"s": '645624', "v": 9.6, "c": "保訪処遇改善加算Ⅳ", "name": "福祉・介護職員処遇改善加算", "value": 400, "method": "syoguu"},
//   {"s": '645625', "v": 10.9, "c": "保訪処遇改善加算Ⅴ１", "name": "福祉・介護職員処遇改善加算", "value": 501, "method": "syoguu"},
//   {"s": '645626', "v": 10.7, "c": "保訪処遇改善加算Ⅴ２", "name": "福祉・介護職員処遇改善加算", "value": 502, "method": "syoguu"},
//   {"s": '645629', "v": 8.7, "c": "保訪処遇改善加算Ⅴ５", "name": "福祉・介護職員処遇改善加算", "value": 505, "method": "syoguu"},
//   {"s": '645631', "v": 8.1, "c": "保訪処遇改善加算Ⅴ７", "name": "福祉・介護職員処遇改善加算", "value": 507, "method": "syoguu"},
//   {"s": '645632', "v": 9.8, "c": "保訪処遇改善加算Ⅴ８", "name": "福祉・介護職員処遇改善加算", "value": 508, "method": "syoguu"},
//   {"s": '645634', "v": 6.1, "c": "保訪処遇改善加算Ⅴ１０", "name": "福祉・介護職員処遇改善加算", "value": 510, "method": "syoguu"},
//   {"s": '645635', "v": 7.6, "c": "保訪処遇改善加算Ⅴ１１", "name": "福祉・介護職員処遇改善加算", "value": 511, "method": "syoguu"},
//   {"s": '645637', "v": 7.0, "c": "保訪処遇改善加算Ⅴ１３", "name": "福祉・介護職員処遇改善加算", "value": 513, "method": "syoguu"},
//   {"s": '645638', "v": 5.0, "c": "保訪処遇改善加算Ⅴ１４", "name": "福祉・介護職員処遇改善加算", "value": 514, "method": "syoguu"},
//   {"s": '645603', "v": 300.0, "c": "保訪家族支援加算Ⅰ１", "name": "家族支援加算Ⅰ", "value": "居宅1時間以上", "limit": "grp4", },
//   {"s": '645604', "v": 200.0, "c": "保訪家族支援加算Ⅰ２", "name": "家族支援加算Ⅰ", "value": "居宅1時間未満", "limit": "grp4", },
//   {"s": '645605', "v": 100.0, "c": "保訪家族支援加算Ⅰ３", "name": "家族支援加算Ⅰ", "value": "事業所対面", "limit": "grp4", },
//   {"s": '645606', "v": 80.0, "c": "保訪家族支援加算Ⅰ４", "name": "家族支援加算Ⅰ", "value": "オンライン", "limit": "grp4", },
//   {"s": '645607', "v": 80.0, "c": "保訪家族支援加算Ⅱ１", "name": "家族支援加算Ⅱ", "value": "事業所対面", "limit": "grp4", },
//   {"s": '645608', "v": 60.0, "c": "保訪家族支援加算Ⅱ２", "name": "家族支援加算Ⅱ", "value": "オンライン", "limit": "grp4", },
//   {"s": '645609', "v": 200.0, "c": "保訪多職種連携支援加算", "name": "多職種連携支援加算", "value": 1, "limit": 1, },
//   {"s": '645610', "v": 120.0, "c": "保訪ケアニーズ対応加算", "name": "ケアニーズ対応加算", "value": 1, },
//   {"s": '645611', "v": 200.0, "c": "保訪強度行動障害児支援加算", "name": "強度行動障害児支援加算", "value": 1, },
//   {"s": '646760', "v": 150.0, "c": "保訪関係機関連携加算", "name": "関係機関連携加算", "value": 1, "limit": 1, },
//   {"s": '645601', "v": 850, "c": "保訪訪問支援員特別加算Ⅰ", "name": "訪問支援員特別加算24", "value": 1,  },
//   {"s": '645601', "v": 700, "c": "保訪訪問支援員特別加算Ⅱ", "name": "訪問支援員特別加算24", "value": 2,  },
// ]
  

export const serviceNameBase = [];
export const serviceNameBaseHD = [];