/**
 * 文字列操作に関連するユーティリティ
 */

// ゼロ埋めを行う
export const zp = (n, l) => {
  n = n ? n : '0';
  let s = '0'.repeat(l);
  n = (s + n).slice(-l);
  return n;
};

// スペースで埋めて文字列長さを揃える
export const spfill = (str, l) => {
  str = str ? str : '';
  let s = ' '.repeat(l);
  return (str + s).slice(0, l);
};

// 全角から半角に変換
export const zen2han = (src) => {
  if (!src) return src;
  const zen = [
    'ア', 'イ', 'ウ', 'エ', 'オ', 'カ', 'キ', 'ク', 'ケ', 'コ',
    'サ', 'シ', 'ス', 'セ', 'ソ', 'タ', 'チ', 'ツ', 'テ', 'ト',
    'ナ', 'ニ', 'ヌ', 'ネ', 'ノ', 'ハ', 'ヒ', 'フ', 'ヘ', 'ホ',
    'マ', 'ミ', 'ム', 'メ', 'モ', 'ヤ', 'ヰ', 'ユ', 'ヱ', 'ヨ',
    'ラ', 'リ', 'ル', 'レ', 'ロ', 'ワ', 'ヲ', 'ン',
    'ガ', 'ギ', 'グ', 'ゲ', 'ゴ', 'ザ', 'ジ', 'ズ', 'ゼ', 'ゾ',
    'ダ', 'ヂ', 'ヅ', 'デ', 'ド', 'バ', 'ビ', 'ブ', 'ベ', 'ボ',
    'パ', 'ピ', 'プ', 'ペ', 'ポ', 'ヴ',
    'ァ', 'ィ', 'ゥ', 'ェ', 'ォ', 'ャ', 'ュ', 'ョ', 'ッ',
    '゛', '°', '、', '。', '「', '」', 'ー', '・', '　',
  ];
  const han = [
    'ｱ', 'ｲ', 'ｳ', 'ｴ', 'ｵ', 'ｶ', 'ｷ', 'ｸ', 'ｹ', 'ｺ',
    'ｻ', 'ｼ', 'ｽ', 'ｾ', 'ｿ', 'ﾀ', 'ﾁ', 'ﾂ', 'ﾃ', 'ﾄ',
    'ﾅ', 'ﾆ', 'ﾇ', 'ﾈ', 'ﾉ', 'ﾊ', 'ﾋ', 'ﾌ', 'ﾍ', 'ﾎ',
    'ﾏ', 'ﾐ', 'ﾑ', 'ﾒ', 'ﾓ', 'ﾔ', 'ｲ', 'ﾕ', 'ｴ', 'ﾖ',
    'ﾗ', 'ﾘ', 'ﾙ', 'ﾚ', 'ﾛ', 'ﾜ', 'ｦ', 'ﾝ',
    'ｶﾞ', 'ｷﾞ', 'ｸﾞ', 'ｹﾞ', 'ｺﾞ', 'ｻﾞ', 'ｼﾞ', 'ｽﾞ', 'ｾﾞ', 'ｿﾞ',
    'ﾀﾞ', 'ﾁﾞ', 'ﾂﾞ', 'ﾃﾞ', 'ﾄﾞ', 'ﾊﾞ', 'ﾋﾞ', 'ﾌﾞ', 'ﾍﾞ', 'ﾎﾞ',
    'ﾊﾟ', 'ﾋﾟ', 'ﾌﾟ', 'ﾍﾟ', 'ﾎﾟ', 'ｳﾞ',
    'ｧ', 'ｨ', 'ｩ', 'ｪ', 'ｫ', 'ｬ', 'ｭ', 'ｮ', 'ｯ',
    'ﾞ', 'ﾟ', '､', '｡', '｢', '｣', 'ｰ', '･', ' ',
  ];

  let dst = '';
  for (let i = 0; i < src.length; i++) {
    const e = src[i];
    const ndx = zen.indexOf(e);
    if (ndx > -1) {
      dst += han[ndx];
    } else {
      dst += e;
    }
  }
  return dst;
};

// ランダムな文字列を作成する
export const randomStr = (length, item = 0) => {
  let filename = "abcdefghijklmnopqrstuvwxyz0123456789";
  let passwd = "abcdefghjkmprstuvyz123456789!#&-";
  let numOnly = "0123456789";
  let passwd2 = "abcdefghjkmprstuvyz123456789123456789123456789!#&-ADWQPRZ";
  let c;
  if (item === 0) c = filename;
  else if (item === 1) c = passwd;
  else if (item === 2) c = numOnly;
  else if (item === 3) c = passwd2;
  
  let cl = c.length;
  let r = "";
  for (let i = 0; i < length; i++) {
    r += c[Math.floor(Math.random() * cl)];
  }
  return r;
};

const passWdPtn = /^(?=.*[a-z])(?=.*[A-Z])(?=.*[0-9])(?=.*[!-/:-@[-`{-~])[!-~]*$/;

export const makePassWd = (length, ptn = passWdPtn) => {
  let c = "abcdefghjkmprstuvyz123456789123456789123456789!#&-ADWQPRZ";
  let matched = false;
  let cl = c.length;
  let r;
  while (matched === false) {
    r = "";
    for (let i = 0; i < length; i++) {
      r += c[Math.floor(Math.random() * cl)];
    }
    matched = ptn.test(r);
  }
  return r;
};

// 半角全角変換
export const convHankaku = (strVal, numMode = false) => {
  if (strVal === undefined) return '';
  if (numMode) strVal = strVal.replace(/^−/, '-');
  strVal = strVal.trim();
  // 半角変換
  var halfVal = strVal.replace(/[！-～]/g, function (tmpStr) {
    return String.fromCharCode(tmpStr.charCodeAt(0) - 0xfee0);
  });

  return halfVal
    .replace(/”/g, '"')
    .replace(/’/g, "'")
    .replace(/‘/g, '`')
    .replace(/￥/g, '\\')
    .replace(/([0-9]+)ー/g, '$1-')
    .replace(/　/g, ' ')
    .replace(/〜/g, '~');
};

// カタカナ→ひらがな
export const convKanaToHira = (str) => {
  if (str === undefined) return '';
  return str.replace(/[\u30a1-\u30f6]/g, function (match) {
    var chr = match.charCodeAt(0) - 0x60;
    return String.fromCharCode(chr);
  });
};

// ひらがな→カタカナ
export const convHiraToKata = (str) => {
  return str.replace(/[\u3041-\u3096]/g, (ch) => String.fromCharCode(ch.charCodeAt(0) + 0x60));
};

export const convHiraToKataAndChk = (str) => {
  str = convHiraToKata(str);
  const result = /^[ァ-ヶー　]+$/.test(str);
  return { result, str };
};

export const convKanaToHiraAndChk = (str) => {
  str = convKanaToHira(str);
  let result;
  if (str.match(/^[ぁ-んーゔ　]*$/)) {
    result = true;
  } else {
    result = false;
  }
  return { result, str };
};

// サービス名の略称などを取得する
export const shortWord = (wd, size = 's') => {
  if (typeof wd === 'object') {
    return JSON.stringify(wd);
  }

  const lst = [
    { l: '放課後等デイサービス', s: '放デイ' },
    { l: '児童発達支援', s: '児発' },
    { l: 'サービス種別', s: 'サービス' },
    { l: '重症心身障害児', s: '重心' },
    { l: '福祉専門職員配置等加算', s: '福祉専門配置' },
    { l: '福祉専門職員配置等加算Ⅰ', s: '福祉配置Ⅰ' },
    { l: '福祉専門職員配置等加算Ⅱ', s: '福祉配置Ⅱ' },
    { l: '福祉専門職員配置等加算Ⅲ', s: '福祉配置Ⅲ' },
    { l: '医療連携体制加算', s: '医療連携' },
    { l: '医療連携体制加算Ⅰ', s: 'Ⅰ' },
    { l: '医療連携体制加算Ⅱ', s: 'Ⅱ' },
    { l: '医療連携体制加算Ⅲ', s: 'Ⅲ' },
    { l: '医療連携体制加算Ⅳ', s: 'Ⅳ' },
    { l: '医療連携体制加算Ⅳ１', s: 'Ⅳ１' },
    { l: '医療連携体制加算Ⅳ２', s: 'Ⅳ２' },
    { l: '医療連携体制加算Ⅳ３', s: 'Ⅳ３' },
    { l: '医療連携体制加算Ⅴ', s: 'Ⅴ' },
    { l: '医療連携体制加算Ⅴ１', s: 'Ⅴ１' },
    { l: '医療連携体制加算Ⅴ２', s: 'Ⅴ２' },
    { l: '医療連携体制加算Ⅴ３', s: 'Ⅴ３' },
    { l: '医療連携体制加算Ⅵ', s: 'Ⅵ' },
    { l: '関係機関連携加算', s: '関係機関連携' },
    { l: '関係機関連携加算Ⅰ', s: 'Ⅰ' },
    { l: '関係機関連携加算Ⅱ', s: 'Ⅱ' },
    { l: '児童指導員配置加算', s: '児童指導員配置' },
    { l: '児童指導員等加配加算（Ⅰ）', s: '指導員等加配Ⅰ' },
    { l: '児童指導員等加配加算（Ⅱ）', s: '指導員等加配Ⅱ' },
    { l: 'その他の従業者', s: 'その他' },
    { l: '身体拘束廃止未実施減算', s: '拘束未実施' },
    { l: '共生型サービス', s: '共生型' },
    { l: '障害児状態等区分', s: '状態区分' },
    { l: '看護職員加配加算', s: '看護職員加配' },
    { l: '看護職員加配加算Ⅰ', s: '看護配置Ⅰ' },
    { l: '看護職員加配加算Ⅱ', s: '看護配置Ⅱ' },
    { l: '看護職員加配加算Ⅲ', s: '看護配置Ⅲ' },
    { l: '4時間以上6時間未満', s: '6時間未満' },
    {
      l: '児童発達支援管理責任者かつ保育士又は児童指導員',
      s: '自発責で保育/指導員',
    },
    { l: '児童発達支援管理責任者の場合', s: '自発責' },
    { l: '保育士又は児童指導員の場合', s: '保育/指導員' },
    { l: '福祉・介護職員処遇改善加算', s: '処遇改善' },
    { l: '福祉・介護職員処遇改善加算Ⅰ', s: '処遇改善Ⅰ' },
    { l: '福祉・介護職員処遇改善加算Ⅱ', s: '処遇改善Ⅱ' },
    { l: '福祉・介護職員処遇改善加算Ⅲ', s: '処遇改善Ⅲ' },
    { l: '福祉・介護職員処遇改善加算Ⅳ', s: '処遇改善Ⅳ' },
    { l: '福祉・介護職員処遇改善加算Ⅴ', s: '処遇改善Ⅴ' },
    { l: '福祉・介護職員処遇改善加算Ⅵ', s: '処遇改善Ⅵ' },
    { l: '利用者負担上限額管理加算', s: '上限管理加算' },
    { l: '定員超過利用減算', s: '定員超過減算' },
    { l: '訪問支援特別加算', s: '訪問支援' },
    { l: '事業所内相談支援加算', s: '事業所内相談' },
    { l: '強度行動障害児支援加算', s: '強行支援' },
    { l: '強度行動障害児支援加算９０日以内', s: '強行支援90日' },
    { l: '保育・教育等移行支援加算', s: '保育教育移行' },
    { l: '医療ケア児基本報酬区分', s: '医療的ケア児' },
    { l: '医療的ケア児32点以上', s: '32点以上' },
    { l: '医療性ケア児16点以上', s: '16点以上' },
    { l: '医療的ケア児3点以上', s: '3点以上' },
    { l: '放デイ身体拘束廃止未実施減算', s: '拘束廃止未実施' },
    { l: '専門的支援加算', s: '専門的支援加算' },
    { l: '個別サポート加算', s: '個別サポート' },
    { l: '個別サポート加算Ⅰ', s: '個別サポⅠ' },
    { l: '個別サポート加算Ⅱ', s: '個別サポⅡ' },
    { l: '個別サポート加算１', s: '個別サポート１' },
    { l: '個別サポート加算２', s: '個別サポート２' },
    { l: '個別サポート加算３', s: '個別サポート３' },
    { l: '欠席時対応加算１', s: '欠席対応１' },
    { l: '欠席時対応加算２', s: '欠席対応２' },
    { l: '人工内耳装用児支援加算', s: '人工内耳支援' },
    { l: '児童発達支援無償化', s: '児発無償化' },
    { l: '福祉・介護職員等ベースアップ等支援加算', s: 'ベースアップ等支援加算' },
    { l: '管理事業所', s: '管理' },
    { l: '協力事業所', s: '協力' },
    { l: '保育所等訪問支援', s: '保訪' },
    { l: '児童発達支援管理責任者', s: '児発管' },
    { l: '通所支援計画未作成減算', s: '未計画減算' },
    { l: 'サービス提供職員欠如減算', s: '人欠減産' },
    { l: '介護保険重複減算', s: '介護重複減算' },
    { l: '入院時情報連携加算', s: '入院情報連携' },
    { l: '要医療児者支援体制加算', s: '要医療支援体制' },
    { l: '精神障害者支援体制加算', s: '精神支援体制' },
    { l: '地域体制強化共同支援加算', s: '地域体制強化共同' },
    { l: '地域生活支援拠点等相談強化加算', s: '地域生活拠点等' },
    { l: 'サービス利用支援', s: '利用支援' },
    { l: '継続サービス利用支援', s: '継続支援' },
    { l: 'モニタリング加算', s: 'モニタ加算' },
    { l: '居宅介護支援事業所等連携加算（訪問、会議参加）', s: '居宅連携・訪問会議' },
    { l: '居宅介護支援事業所等連携加算（情報提供）', s: '居宅連携・情報提供' },
    { l: '保育教育等移行支援加算（訪問・会議参加）', s: '保育移行・訪問会議' },
    { l: '保育教育等移行支援加算（情報提供）', s: '保育移行・情報提供' },
    { l: '行動障害支援体制加算', s: '行動障害支援体制' },
    { l: '集中支援加算（訪問）', s: '集中支援・訪問' },
    { l: '集中支援加算（会議開催）', s: '集中支援・会議開催' },
    { l: '集中支援加算（会議参加）', s: '集中支援・会議参加' },
    { l: '児童発達支援管理責任者欠如減算', s: '責任者欠如' },
    { l: '視覚聴覚言語機能障害児支援加算', s: '視覚聴覚言語' },
    { l: '子育てサポート加算', s: '子育サポート' },
    { l: '専門的支援実施加算', s: '専門支援実施' },
    { l: '児童指導員等加配加算', s: '児童指導員加配' },
    { l: '自立サポート加算', s: '自立サポート' },
    { l: '事業所間連携加算', s: '事業所間連携' },
    { l: '通所自立支援加算', s: '通所自立支援' },
    { l: '訪問支援員特別加算', s: '訪問支援特別' },
    { l: '多職種連携支援加算', s: '多職種連携' },
    { l: 'ケアニーズ対応加算', s: 'ケアニーズ' },
    { l: '家族支援加算Ⅰ', s: '家族支援Ⅰ' },
    { l: '家族支援加算Ⅱ', s: '家族支援Ⅱ' },
    { l: '中核機能強化事業所加算', s: '中核強化事業所' },
    { l: '医療的ケア児基本報酬', s: '医ケア基本報酬' },
    { l: '医療的ケア児延長支援', s: '医ケア延長支援' },
    { l: '強度行動障害児支援加算無効化', s: '強行支援無効化' },
    { l :'栄養士配置加算', s: '栄養士配置' },
    { l :'栄養士配置加算Ⅰ', s: 'Ⅰ' },
    { l :'栄養士配置加算Ⅱ', s: 'Ⅱ' },
    { l :'専門的支援体制加算', s: '専門的支援体制' },
  ];

  const r = lst.filter((e) => e.l === wd);
  if (!r.length) return wd;
  return size === 's' ? r[0].s : r[0].m;
};

// サービス名の末尾の中黒を削除する
// サービス名とかでついている末尾の中黒を想定
export const deleteLast = (s, l) => {
  if (s.slice(-1) === l) {
    return s.slice(0, -1);
  } else {
    return s;
  }
};

/**
 * サービスが該当するかどうか (カンマ区切りの文字列に対応)
 */
export const inService = (svcsWithComma, svc) => {
  if (!svc) return true;
  if (typeof svcsWithComma === 'string') {
    return svcsWithComma.split(',').includes(svc);
  }
  return false;
};

