export const syougaiSoudanService = [
{"s": "551161", "c": "児童強化型利用支援Ⅰ", "name": "サービス利用支援", "opt": "強化型支援Ⅰ", "v": 2201, "baseItem": true},
{"s": "551171", "c": "児童強化型利用支援Ⅱ", "name": "サービス利用支援", "opt": "強化型支援Ⅱ", "v": 2101, "baseItem": true},
{"s": "551181", "c": "児童強化型利用支援Ⅲ", "name": "サービス利用支援", "opt": "強化型支援Ⅲ", "v": 2016, "baseItem": true},
{"s": "551191", "c": "児童強化型利用支援Ⅳ", "name": "サービス利用支援", "opt": "強化型支援Ⅳ", "v": 1866, "baseItem": true},
{"s": "551111", "c": "児童利用支援Ⅰ", "name": "サービス利用支援", "opt": "支援Ⅰ", "v": 1766, "baseItem": true},
{"s": "551131", "c": "児童利用支援Ⅱ", "name": "サービス利用支援", "opt": "支援Ⅱ", "v": 815, "baseItem": true},
{"s": "551261", "c": "児童強化型継続支援Ⅰ", "name": "継続サービス利用支援", "opt": "強化型支援Ⅰ", "v": 1896, "baseItem": true},
{"s": "551271", "c": "児童強化型継続支援Ⅱ", "name": "継続サービス利用支援", "opt": "強化型支援Ⅱ", "v": 1796, "baseItem": true},
{"s": "551281", "c": "児童強化型継続支援Ⅲ", "name": "継続サービス利用支援", "opt": "強化型支援Ⅲ", "v": 1699, "baseItem": true},
{"s": "551291", "c": "児童強化型継続支援Ⅳ", "name": "継続サービス利用支援", "opt": "強化型支援Ⅳ", "v": 1548, "baseItem": true},
{"s": "551211", "c": "児童継続支援Ⅰ", "name": "継続サービス利用支援", "opt": "支援Ⅰ", "v": 1448, "baseItem": true},
{"s": "551231", "c": "児童継続支援Ⅱ", "name": "継続サービス利用支援", "opt": "支援Ⅱ", "v": 662, "baseItem": true}
]
